In [1]:
%load_ext sql
%sql sqlite://
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [2]:
%%sql

DROP TABLE IF EXISTS Employees;
DROP TABLE IF EXISTS Students;
DROP TABLE IF EXISTS Faculties;

PRAGMA foreign_keys = ON; -- важно в SQLite

CREATE TABLE Faculties(
    id integer,
    name varchar(50) NOT NULL,
    UNIQUE (name), -- уникальные значения
    PRIMARY KEY (id)
    );

CREATE TABLE Students(
    id integer PRIMARY KEY,
    name varchar(50) NOT NULL,
    gpa decimal(2,2),
    faculty_id int,
    FOREIGN KEY (faculty_id) REFERENCES Faculties(id)
    );

CREATE TABLE Employees(
    id integer PRIMARY KEY,
    name varchar(50) NOT NULL,
    phone varchar(50),
    title varchar(50) NOT NULL,
    manager_id integer,
    FOREIGN KEY (manager_id) REFERENCES Employees(id)
    );

 * sqlite://
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

![image.png]()

In [3]:
%%sql
INSERT INTO Faculties VALUES (1, 'IT');
INSERT INTO Faculties VALUES (2, 'KIB');

INSERT INTO Students VALUES (1, 'Sidorov', 3.0, 1);
INSERT INTO Students VALUES (2, 'Petrov', 3.5, 2);
INSERT INTO Students VALUES (3, 'Verikov', 4.0, 1);
INSERT INTO Students VALUES (4, 'Smith', 4.2, 2);
INSERT INTO Students VALUES (5, 'Lee', 4.5, 1);
INSERT INTO Students VALUES (6, 'Vorontsov', 3.2, null);

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [4]:
%%sql
--INSERT INTO Employees VALUES  (2, 'James', '+112', 'Vice President', 1);
INSERT INTO Employees VALUES (1, 'Vasyugin', '+111', 'Director', null);
INSERT INTO Employees VALUES (2, 'Jones', '+112', 'Vice President', 1);
INSERT INTO Employees VALUES (3, 'Smith', '+113', 'Vice President', 1);
INSERT INTO Employees VALUES (4, 'Velaskes', '+114', 'Developer', 2);
INSERT INTO Employees VALUES (5, 'Simon', '+115', 'Analyst', 2);
INSERT INTO Employees VALUES (6, 'Johnson', '+116', 'Engineer', 3);
INSERT INTO Employees VALUES (7, 'Lee', '+117', 'Engineer', 3);

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

# Работа с множествами

## Операция объединения

Вывести имена студентов со средним баллом, большим 3, или с именем, начинающимся с S.

In [5]:
%%sql
SELECT * FROM Students;

 * sqlite://
Done.

[(1, 'Sidorov', 3, 1),
 (2, 'Petrov', 3.5, 2),
 (3, 'Verikov', 4, 1),
 (4, 'Smith', 4.2, 2),
 (5, 'Lee', 4.5, 1),
 (6, 'Vorontsov', 3.2, None)]

In [6]:
%%sql
SELECT name
    FROM Students
WHERE name LIKE 'S%'

UNION

SELECT name
    FROM Students
WHERE gpa > 3;

 * sqlite://
Done.

[('Lee',), ('Petrov',), ('Sidorov',), ('Smith',), ('Verikov',), ('Vorontsov',)]

In [7]:
%%sql
SELECT name
    FROM Students
WHERE name LIKE 'S%'

UNION ALL

SELECT name
    FROM Students
WHERE gpa > 3;

 * sqlite://
Done.

[('Sidorov',),
 ('Smith',),
 ('Petrov',),
 ('Verikov',),
 ('Smith',),
 ('Lee',),
 ('Vorontsov',)]

Вывести имена студентов и имена сотрудников, и указать 1, если студент, 0, если сотрудник

In [8]:
%%sql
SELECT name, 1 as person_type
    FROM Students

UNION ALL

SELECT name as name_new, 0
    FROM Employees;

 * sqlite://
Done.

[('Sidorov', 1),
 ('Petrov', 1),
 ('Verikov', 1),
 ('Smith', 1),
 ('Lee', 1),
 ('Vorontsov', 1),
 ('Vasyugin', 0),
 ('Jones', 0),
 ('Smith', 0),
 ('Velaskes', 0),
 ('Simon', 0),
 ('Johnson', 0),
 ('Lee', 0)]

## Операция пересечения

Вывести такие имена, которые есть одновременно у сотрудников и студентов

In [9]:
%%sql
SELECT name
    FROM Students

INTERSECT

SELECT name
    FROM Employees;

 * sqlite://
Done.

[('Lee',), ('Smith',)]

## Операция разности

Вывести имена, которые встречаются среди студентов, но которых нет у сотрудников

In [10]:
%%sql
SELECT name
    FROM Students

EXCEPT

SELECT name
    FROM Employees;

 * sqlite://
Done.

[('Petrov',), ('Sidorov',), ('Verikov',), ('Vorontsov',)]

## Вложенные подзапросы

### Поиск по множеству

Вывести студентов с факультета ИТ или Кибернетики

In [11]:
%%sql
SELECT *
    FROM Students
WHERE faculty_id in (SELECT id FROM Faculties WHERE name in ('IT', 'KIB'));

 * sqlite://
Done.

[(1, 'Sidorov', 3, 1),
 (2, 'Petrov', 3.5, 2),
 (3, 'Verikov', 4, 1),
 (4, 'Smith', 4.2, 2),
 (5, 'Lee', 4.5, 1)]

Вывести студентов, которые не учатся на факультете ИТ

In [12]:
%%sql
SELECT *
    FROM Students
WHERE faculty_id not in (SELECT id FROM Faculties WHERE name = 'IT');

 * sqlite://
Done.

[(2, 'Petrov', 3.5, 2), (4, 'Smith', 4.2, 2)]

Заметьте, что есть еще один студент не с факультета ИТ

In [13]:
%%sql
SELECT *
    FROM Students
WHERE faculty_id not in (SELECT id FROM Faculties WHERE name = 'IT')
    OR faculty_id is null;

 * sqlite://
Done.

[(2, 'Petrov', 3.5, 2), (4, 'Smith', 4.2, 2), (6, 'Vorontsov', 3.2, None)]

In [14]:
%%sql
SELECT *
    FROM Students
WHERE coalesce(faculty_id, -1) not in (SELECT id FROM Faculties WHERE name = 'IT');

 * sqlite://
Done.

[(2, 'Petrov', 3.5, 2), (4, 'Smith', 4.2, 2), (6, 'Vorontsov', 3.2, None)]

Вывести студентов со средним баллом, большим чем средний балл у худшего студента с факультета Кибернетики

In [15]:
%%sql
SELECT *
    FROM Students
WHERE gpa > (
    SELECT MIN(gpa)
        FROM Students
    WHERE faculty_id = (select id FROM Faculties WHERE name = 'KIB')
    );

 * sqlite://
Done.

[(3, 'Verikov', 4, 1), (4, 'Smith', 4.2, 2), (5, 'Lee', 4.5, 1)]

Вывести студентов со средним баллом, большего чем средний балл у лучшего из худших студентов по факультету

Как не стоит писать:

In [16]:
%%sql
SELECT faculty_id, MIN(gpa)
    FROM Students
GROUP BY faculty_id

 * sqlite://
Done.

[(None, 3.2), (1, 3), (2, 3.5)]

In [17]:
%%sql
SELECT *
FROM Students
WHERE gpa > (
    SELECT MIN(gpa)
        FROM Students
    GROUP BY faculty_id
    );

 * sqlite://
Done.

[(2, 'Petrov', 3.5, 2),
 (3, 'Verikov', 4, 1),
 (4, 'Smith', 4.2, 2),
 (5, 'Lee', 4.5, 1)]

In [18]:
%%sql
SELECT *
    FROM Students
WHERE gpa > (
    SELECT MIN(gpa)
        FROM Students
    GROUP BY faculty_id
    ORDER BY min(gpa) desc
    );

 * sqlite://
Done.

[(3, 'Verikov', 4, 1), (4, 'Smith', 4.2, 2), (5, 'Lee', 4.5, 1)]

Правильные варианты:

In [19]:
%%sql
SELECT *
    FROM Students
WHERE gpa > (
    SELECT max(gpa)
        FROM (
            SELECT MIN(gpa) as gpa
                FROM Students
            GROUP BY faculty_id)
            );

 * sqlite://
Done.

[(3, 'Verikov', 4, 1), (4, 'Smith', 4.2, 2), (5, 'Lee', 4.5, 1)]

In [20]:
%%sql
SELECT s.*
    FROM Students s, (
    SELECT max(gpa) as m_gpa
        FROM (
            SELECT MIN(gpa) as gpa
                FROM Students
            GROUP BY faculty_id)
            )
WHERE s.gpa > m_gpa;

 * sqlite://
Done.

[(3, 'Verikov', 4, 1), (4, 'Smith', 4.2, 2), (5, 'Lee', 4.5, 1)]

Вывести студентов со средним баллом, который больше чем минимальный средний балл на их факультете

In [21]:
%%sql
SELECT *
    FROM Students
WHERE faculty_id = 1;

 * sqlite://
Done.

[(1, 'Sidorov', 3, 1), (3, 'Verikov', 4, 1), (5, 'Lee', 4.5, 1)]

In [22]:
%%sql
SELECT *
    FROM Students s_o
WHERE EXISTS (
    SELECT 1
        FROM Students s_i
    WHERE s_o.faculty_id = s_i.faculty_id
        AND s_o.gpa > s_i.gpa
    );

 * sqlite://
Done.

[(3, 'Verikov', 4, 1), (4, 'Smith', 4.2, 2), (5, 'Lee', 4.5, 1)]

In [23]:
%%sql
SELECT s.*
    FROM Students s
INNER JOIN
(
    SELECT faculty_id, min(gpa) as min_gpa
        FROM Students
    GROUP BY faculty_id
) g
ON s.faculty_id = g.faculty_id
WHERE s.gpa > g.min_gpa;

 * sqlite://
Done.

[(3, 'Verikov', 4, 1), (4, 'Smith', 4.2, 2), (5, 'Lee', 4.5, 1)]

## Скалярные подзапросы

Вывести для каждого факультета количество студентов на факультете

In [24]:
%%sql
SELECT id, name, (SELECT count(*) FROM Students s WHERE s.faculty_id = f.id) as cnt
    FROM Faculties f;

 * sqlite://
Done.

[(1, 'IT', 3), (2, 'KIB', 2)]

## Соединения JOIN

In [25]:
%%sql
SELECT * FROM Students;

 * sqlite://
Done.

[(1, 'Sidorov', 3, 1),
 (2, 'Petrov', 3.5, 2),
 (3, 'Verikov', 4, 1),
 (4, 'Smith', 4.2, 2),
 (5, 'Lee', 4.5, 1),
 (6, 'Vorontsov', 3.2, None)]

In [26]:
%%sql
SELECT * FROM Faculties;

 * sqlite://
Done.

[(1, 'IT'), (2, 'KIB')]

In [27]:
%%sql
SELECT *
    FROM Students s
JOIN Faculties f
    ON s.faculty_id = f.id;

 * sqlite://
Done.

[(1, 'Sidorov', 3, 1, 1, 'IT'),
 (2, 'Petrov', 3.5, 2, 2, 'KIB'),
 (3, 'Verikov', 4, 1, 1, 'IT'),
 (4, 'Smith', 4.2, 2, 2, 'KIB'),
 (5, 'Lee', 4.5, 1, 1, 'IT')]

In [28]:
%%sql
SELECT s.*, f.*
    FROM Students s
NATURAL JOIN Faculties f;

 * sqlite://
Done.

[]

In [29]:
%%sql
SELECT * FROM Students;

 * sqlite://
Done.

[(1, 'Sidorov', 3, 1),
 (2, 'Petrov', 3.5, 2),
 (3, 'Verikov', 4, 1),
 (4, 'Smith', 4.2, 2),
 (5, 'Lee', 4.5, 1),
 (6, 'Vorontsov', 3.2, None)]

In [30]:
%%sql
SELECT *
    FROM Students s
INNER JOIN Faculties f
    ON s.faculty_id = f.id;

 * sqlite://
Done.

[(1, 'Sidorov', 3, 1, 1, 'IT'),
 (2, 'Petrov', 3.5, 2, 2, 'KIB'),
 (3, 'Verikov', 4, 1, 1, 'IT'),
 (4, 'Smith', 4.2, 2, 2, 'KIB'),
 (5, 'Lee', 4.5, 1, 1, 'IT')]

In [31]:
%%sql
SELECT *
    FROM Students s
LEFT JOIN Faculties f
    ON s.faculty_id = f.id;

 * sqlite://
Done.

[(1, 'Sidorov', 3, 1, 1, 'IT'),
 (2, 'Petrov', 3.5, 2, 2, 'KIB'),
 (3, 'Verikov', 4, 1, 1, 'IT'),
 (4, 'Smith', 4.2, 2, 2, 'KIB'),
 (5, 'Lee', 4.5, 1, 1, 'IT'),
 (6, 'Vorontsov', 3.2, None, None, None)]

In [32]:
%%sql
SELECT *
    FROM Students s
LEFT OUTER JOIN Faculties F
    ON s.faculty_id = f.id;

 * sqlite://
Done.

[(1, 'Sidorov', 3, 1, 1, 'IT'),
 (2, 'Petrov', 3.5, 2, 2, 'KIB'),
 (3, 'Verikov', 4, 1, 1, 'IT'),
 (4, 'Smith', 4.2, 2, 2, 'KIB'),
 (5, 'Lee', 4.5, 1, 1, 'IT'),
 (6, 'Vorontsov', 3.2, None, None, None)]

In [33]:
%%sql
SELECT *
    FROM Students s
JOIN Employees e
    ON s.name = e.name;

 * sqlite://
Done.

[(4, 'Smith', 4.2, 2, 3, 'Smith', '+113', 'Vice President', 1),
 (5, 'Lee', 4.5, 1, 7, 'Lee', '+117', 'Engineer', 3)]

In [34]:
%%sql
SELECT *
    FROM Students s
CROSS JOIN Faculties F;

 * sqlite://
Done.

[(1, 'Sidorov', 3, 1, 1, 'IT'),
 (1, 'Sidorov', 3, 1, 2, 'KIB'),
 (2, 'Petrov', 3.5, 2, 1, 'IT'),
 (2, 'Petrov', 3.5, 2, 2, 'KIB'),
 (3, 'Verikov', 4, 1, 1, 'IT'),
 (3, 'Verikov', 4, 1, 2, 'KIB'),
 (4, 'Smith', 4.2, 2, 1, 'IT'),
 (4, 'Smith', 4.2, 2, 2, 'KIB'),
 (5, 'Lee', 4.5, 1, 1, 'IT'),
 (5, 'Lee', 4.5, 1, 2, 'KIB'),
 (6, 'Vorontsov', 3.2, None, 1, 'IT'),
 (6, 'Vorontsov', 3.2, None, 2, 'KIB')]

In [35]:
%%sql
SELECT *
    FROM Students s
LEFT JOIN Faculties F
USING (id);

 * sqlite://
Done.

[(1, 'Sidorov', 3, 1, 'IT'),
 (2, 'Petrov', 3.5, 2, 'KIB'),
 (3, 'Verikov', 4, 1, None),
 (4, 'Smith', 4.2, 2, None),
 (5, 'Lee', 4.5, 1, None),
 (6, 'Vorontsov', 3.2, None, None)]

Для каждого сотрудника вывести имя и должность его начальника

In [36]:
%%sql
SELECT e1.id, e1.name, e1.title, e2.name as manager, e2.title as manager_title
    FROM Employees e1
LEFT JOIN Employees e2
    ON e1.manager_id = e2.id;

 * sqlite://
Done.

[(1, 'Vasyugin', 'Director', None, None),
 (2, 'Jones', 'Vice President', 'Vasyugin', 'Director'),
 (3, 'Smith', 'Vice President', 'Vasyugin', 'Director'),
 (4, 'Velaskes', 'Developer', 'Jones', 'Vice President'),
 (5, 'Simon', 'Analyst', 'Jones', 'Vice President'),
 (6, 'Johnson', 'Engineer', 'Smith', 'Vice President'),
 (7, 'Lee', 'Engineer', 'Smith', 'Vice President')]